// app.js
App({
  yiyuan: [{
      "icon": "/res/img/医院图标_通用.png",
      "name": "盛京医院",
      "fullname": "中国医科大学附属盛京医院",
      "label": "公立 三甲 综合医院",
      "describe": "测试文本段1\n测试文本段2"
    }, {
      "icon": "/res/img/医院图标_通用.png",
      "name": "中国医大一院",
      "fullname": "中国医科大学附属第一医院",
      "label": "公立 三甲 综合医院",
      "describe": "测试文本段1\n测试文本段2"
    }, {
      "icon": "/res/img/医院图标_通用.png",
      "name": "辽宁省人民医院",
      "fullname": "辽宁省人民医院",
      "label": "公立 三甲 综合医院",
      "describe": "辽宁省人民医院暨中国医科大学人民医院、辽宁省心血管病医院、辽宁省红十字会医院，是省卫生健康委直属的大型现代化综合性三级甲等医院."
    }, {
      "icon": "/res/img/医院图标_通用.png",
      "name": "北部战区总医院",
      "fullname": "北部战区总医院",
      "label": "公立 三甲 综合医院",
      "describe": "北部战区总医院诞生于炮火硝烟的解放战争时期，先后执行抗美援朝、珍宝岛作战等重大卫勤保障任务。."
    },
    {
      "icon": "/res/img/医院图标_大连医科大学附一院.png",
      "name": "大连医科大学附一院",
      "fullname": "大连医科大学附属第一医院",
      "label": "公立 三甲 综合医院",
      "describe": "大连医科大学附属第一医院始建于1930年，经过90余年的发展，现已成为集医疗、教学、科研为一体的综合性现代化三级甲等医院。医院建筑面积39.19万平方米，由长春路院区、联合路院区、金普院区、泉涌院区、张前路医院五个院区组成。现编制床位3700张，是辽宁地区综合实力最强、百姓最信赖的三级甲等医疗研究型大学附属医院之一。医院持续“一院五院区”协同发展，打造“一体两翼”战略布局，全面推动医院各项事业实现创新协调高质量发展，稳居辽南龙头地位，连续七年进入中国顶级医院百强。"
    },
    {
      "icon": "/res/img/医院图标_大连医科大学附二院.png",
      "name": "大连医科大学附二院",
      "fullname": "大连医科大学附属第二医院",
      "label": "公立 三甲 综合医院",
      "describe": "大连医科大学附属第二医院（附属肿瘤医院）始建于1958年，1969年随大连医学院南迁遵义。1987年回迁复建，1991年独立办院，1999年挂牌大连医科大学附属肿瘤医院。是一所集医疗、教学、科研、健康管理等于一体的大型综合性省级直属三级甲等医院，是国家肿瘤区域医疗中心建设单位。医院由星海院区、钻石湾院区和蓝湾院区组成，在西安路商圈开设口腔医学中心，委托管理东软集团心血管病医院，形成一院五区布局。"
    }, {
      "icon": "/res/img/医院图标_大连大学附属中山医院.png",
      "name": "大连大学附属中山医院",
      "fullname": "大连大学附属中山医院",
      "label": "公立 三甲 综合医院",
      "describe": "大连大学附属中山医院创建于1907年，前身是由沙俄在大连山城町（现胜利桥）建立的东清铁道大连病院， 1907年，日本满铁株式会社在其基础上建立了当时亚洲最大的医院之一——满铁大连病院。2005年，医院正式归属大连大学，更名为大连大学附属中山医院。医院是一所集预防、医疗、教学、科研、康复为一体的综合性大学附属医院。占地面积9万平方米，建筑面积近20万平方米，1992年在辽宁省首批晋升为国家三级甲等医院。医院承担大连大学、大连医科大学、遵义医学院等院校包括博士、硕士研究生在内的5个层次、16个专业的教学任务。"
    },
    {
      "icon": "/res/img/医院图标_辽阳市中心医院.png",
      "name": "辽阳市中心医院",
      "fullname": "中国医科大学辽阳中心医院",
      "label": "公立 三甲 综合医院",
      "describe": "辽阳市中心医院1948年建院，至今走过55个春秋，已成为辽阳市唯一一家三级甲等医院，是辽阳城乡180万人口的医疗、预防、科研、教学中心。是中国人寿保险公司、中国平安人寿保险公司、中国太平洋人寿保险公司、市城镇职工医疗保险中心的定点医院，是市交通事故创伤治疗中心，是中国医科大学教学医院。辽阳市检验中心、眼病研究所，肿瘤研究所、手足显微外科研究所均设在市中心医院。"
    },
    {
      "icon": "/res/img/医院图标_大连市中心医院.png",
      "name": "大连市中心医院",
      "fullname": "大连市中心医院",
      "label": "公立 三甲 综合医院",
      "describe": "大连市中心医院始建于1949年，是一所集医疗、教学、科研、预防、保健、康复于一体的三级甲等综合医院，是大连市卫生健康委直属规模最大的医疗机构，是大连理工大学附属中心医院，大连市退役军人医院，中国医科大学、大连医科大学和辽宁中医药大学的教学医院、研究生培养基地，是辽宁省唯一的国家神经系统疾病临床医学研究中心区域分中心。下辖大连市医药科学研究所、大连理论医学研究所。医院分南北两个院区，占地面积6.5万㎡，建筑面积10.7万㎡，编制床位2350张。2021年国家三级公立医院绩效考核跻身A级，全省排名第五。"
    },
    {
      "icon": "/res/img/医院图标_辽宁省人民医院.png",
      "name": "辽宁省人民医院",
      "fullname": "辽宁省人民医院",
      "label": "公立 三甲 综合医院",
      "describe": "辽宁省人民医院暨中国医科大学人民医院、辽宁省心血管病医院、辽宁省红十字会医院，是省卫生健康委直属的大型现代化综合性三级甲等医院。医院承担临床医疗、医学教育、医学科研、预防保健、应急救援等任务，是全国首批现代化管理型医院试点单位，中国医科大学非直属临床学院，大连医科大学、锦州医科大学、辽宁中医药大学、辽宁医药职业技术学院、沈阳药科大学的临床教学实习基地，国家住院医师规范化培训基地。"
    },
    {
      "icon": "/res/img/医院图标_朝阳市中心医院.png",
      "name": "朝阳市中心医院",
      "fullname": "朝阳市中心医院",
      "label": "公立 三甲 综合医院",
      "describe": "医院的前身是1937年成立的土默特右旗医院，床位30张；1946年更名为朝阳卫生院；解放后更名为朝阳县卫生院；1959年更名为朝阳市医院，床位200张；1964年更名为朝阳专区人民医院；1970年更名为朝阳市人民医院，床位400张；1974年更名为朝阳地区人民医院，1984年更名为朝阳市第一人民医院，床位500张；1993年更名为朝阳市中心医院，床位703张；1997年晋升为三级甲等医院；2013年床位增至1408张；目前实际开放床位数1595张。"
    },
    {
      "icon": "/res/img/医院图标_沈阳市四院.png",
      "name": "沈阳市四院",
      "fullname": "沈阳市第四人民医院",
      "label": "公立 三甲 综合医院",
      "describe": "沈阳市第四人民医院始建于1953年，五十年励炼，五十年沉淀，医院幼年趋向成熟，以自己独特的文化底蕴，展示在世人面前。医院占地面积4.1万平方米，建筑面积6.9万平方米，欧式现代派风格的花园式庭院垂柳经草，片片绿茵，门诊宽敞明亮，病房清洁舒适，为病人提供良好的就医环境。医院拥有市级医院一流的设备，核磁共振、螺旋CT、大型彩超、欧林巴斯内窥镜系统、全自动生化分析仪等百余台件。"
    },
    {
      "icon": "/res/img/医院图标_辽宁省肿瘤医院.png",
      "name": "辽宁省肿瘤医院",
      "fullname": "辽宁省肿瘤医院暨大连理工大学附属肿瘤医院",
      "label": "公立 三甲 综合医院",
      "describe": "辽宁省肿瘤医院暨大连理工大学附属肿瘤医院始建于1975年，是集肿瘤防治、科研、教学为一体的省级肿瘤防治中心。医院拥有全国肿瘤科普教育基地、国家药物临床试验机构2个国家级机构，肿瘤护理1个国家临床重点专科、肿瘤学1个国家临床重点专科建设项目；同时拥有11个省级重点实验室、1个省级临床医学研究中心、9个省级临床重点专科、5个省级临床重点专科建设项目。医院被评为辽宁省健康教育示范基地，是辽宁省肿瘤规范化诊疗中心的依托单位。为积极打造院校合作平台，向临床研究型医院迈进，2021年，医院成为大连理工大学附属肿瘤医院。医院也是大连理工大学、中国医科大学、大连医科大学、辽宁中医药大学等学校的研究生培养基地。"
    }
  ],
  onLaunch() {
    // 展示本地存储能力
    const logs = wx.getStorageSync('logs') || []
    logs.unshift(Date.now())
    wx.setStorageSync('logs', logs)

    // 登录
    wx.login({
      success: res => {
        // 发送 res.code 到后台换取 openId, sessionKey, unionId
      }
    })
  },
  globalData: {
    userInfo: null
  }
})